# Merging Dataframe
See [documentation](http://pandas.pydata.org/pandas-docs/stable/merging.html)

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
import pandas as pd

## `pd.concat()`

In [32]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])
 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

In [10]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [11]:
pd.concat([df1, df2], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [39]:
pd.concat([df1, df2], axis=1, keys=['A'])

    A
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [41]:
pd.concat([df1, df2], axis=1, keys=['A','B'])

     A                   B
     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [44]:
pd.concat([df1, df2], keys=['A','B'])

      A   B   C   D
A 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
B 4  A4  B4  C4  D4
  5  A5  B5  C5  D5
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7

In [26]:
df1_noindex = df1.copy().reset_index(drop=True)
df2_noindex = df2.copy().reset_index(drop=True)
pd.concat([df1_noindex, df2_noindex], axis=1)

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

## `pd.merge()`

In [53]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

print(left)
print(right)

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3
    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [52]:
result = pd.merge(left, right, on='key')
result

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

## `pd.DataFrame.join()`

In [60]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                       index=['K0', 'K2', 'K3'])

Using `left`'s index.

In [61]:
result = left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

Using `right`'s index

In [65]:
result = right.join(left)
result

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

Union

In [63]:
result = left.join(right, how='outer')
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Intersect

In [64]:
result = left.join(right, how='inner')
result

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [12]:
# import pandas as pd
import pandas as pd

# creating dataframes as df1 and df2
df1 = pd.DataFrame({'ID': [2, 2, 3, 5, 6, 7, 8],
					'Name': ['Two', 'Two', 'Three', 'Five', 'Six', 'Seven', 'Eight']})

df1

df2 = pd.DataFrame({'ID': [1, 2, 4, 5, 8, 8, 9],
					'Marks': [11, 22, 44, 55, 881, 882, 99, ]})

df2

# merging df1 and df2 based on the 'left' df ID
# i.e. the rows with ID's common with those from the 'left' get merged
df = pd.merge(df1, df2, on="ID", how='left')
df

   ID   Name
0   2    Two
1   2    Two
2   3  Three
3   5   Five
4   6    Six
5   7  Seven
6   8  Eight

   ID  Marks
0   1     11
1   2     22
2   4     44
3   5     55
4   8    881
5   8    882
6   9     99

   ID   Name  Marks
0   2    Two   22.0
1   2    Two   22.0
2   3  Three    NaN
3   5   Five   55.0
4   6    Six    NaN
5   7  Seven    NaN
6   8  Eight  881.0
7   8  Eight  882.0

In [13]:
# import pandas as pd
import pandas as pd

# creating dataframes as df1 and df2
df1 = pd.DataFrame({'ID': [2, 2, 3, 5, 6, 7, 8],
					'Name': ['Two', 'Two', 'Three', 'Five', 'Six', 'Seven', 'Eight']})

df1

df2 = pd.DataFrame({'ID': [1, 2, 4, 5, 8, 8, 9],
					'Marks': [11, 22, 44, 55, 881, 882, 99, ]})

df2

# merging df1 and df2 based on the 'right' df ID
# i.e. the rows with ID's common with those from the 'right' get merged
df = pd.merge(df1, df2, on="ID", how='right')
df

   ID   Name
0   2    Two
1   2    Two
2   3  Three
3   5   Five
4   6    Six
5   7  Seven
6   8  Eight

   ID  Marks
0   1     11
1   2     22
2   4     44
3   5     55
4   8    881
5   8    882
6   9     99

   ID   Name  Marks
0   2    Two     22
1   2    Two     22
2   5   Five     55
3   8  Eight    881
4   8  Eight    882
5   1    NaN     11
6   4    NaN     44
7   9    NaN     99

In [15]:
# import pandas as pd
import pandas as pd

# creating dataframes as df1 and df2
df1 = pd.DataFrame({'ID': [2, 2, 3, 5, 6, 7, 8],
					'Name': ['Two', 'Two', 'Three', 'Five', 'Six', 'Seven', 'Eight']})

df1

df2 = pd.DataFrame({'ID': [1, 2, 4, 5, 8, 8, 9],
					'Marks': [11, 22, 44, 55, 881, 882, 99, ]})

df2

# merging df1 and df2 by ID common on both df
# i.e. the rows with ID's common on both dataframe get merged
df = pd.merge(df1, df2, on="ID")
df

   ID   Name
0   2    Two
1   2    Two
2   3  Three
3   5   Five
4   6    Six
5   7  Seven
6   8  Eight

   ID  Marks
0   1     11
1   2     22
2   4     44
3   5     55
4   8    881
5   8    882
6   9     99

   ID   Name  Marks
0   2    Two     22
1   2    Two     22
2   5   Five     55
3   8  Eight    881
4   8  Eight    882

In [18]:
# import pandas as pd
import pandas as pd

# creating dataframes as df1 and df2
df1 = pd.DataFrame({'ID': [2, 2, 3, 5, 6, 7, 8],
					'Name': ['Two', 'Two', 'Three', 'Five', 'Six', 'Seven', 'Eight'],
                    'Marks': [22, 221, 33, 55, 66, 77, 881 ]})

df1

df2 = pd.DataFrame({'ID': [1, 2, 4, 5, 8, 8, 9],
					'Marks': [11, 22, 44, 55, 881, 882, 99, ]})

df2

# merging df1 and df2 based on ID common on both df
# i.e. the rows with ID's common on both dataframe get merged
df = pd.merge(df1, df2, on="ID")
df

   ID   Name  Marks
0   2    Two     22
1   2    Two    221
2   3  Three     33
3   5   Five     55
4   6    Six     66
5   7  Seven     77
6   8  Eight    881

   ID  Marks
0   1     11
1   2     22
2   4     44
3   5     55
4   8    881
5   8    882
6   9     99

   ID   Name  Marks_x  Marks_y
0   2    Two       22       22
1   2    Two      221       22
2   5   Five       55       55
3   8  Eight      881      881
4   8  Eight      881      882

In [20]:
# import pandas as pd
import pandas as pd

# creating dataframes as df1 and df2
df1 = pd.DataFrame({'ID': [2, 2, 3, 5, 6, 7, 8],
					'Name': ['Two', 'Two', 'Three', 'Five', 'Six', 'Seven', 'Eight'],
                    'Marks': [22, 221, 33, 55, 66, 77, 881 ]})

df1

df2 = pd.DataFrame({'ID': [1, 2, 4, 5, 8, 8, 9],
					'Marks': [11, 22, 44, 55, 881, 882, 99, ]})

df2

# merging df1 and df2 based on the 'left' df ID
# i.e. the rows with ID's from 'left' dataframe get merged
df = pd.merge(df1, df2, on="ID", how='left')
df

   ID   Name  Marks
0   2    Two     22
1   2    Two    221
2   3  Three     33
3   5   Five     55
4   6    Six     66
5   7  Seven     77
6   8  Eight    881

   ID  Marks
0   1     11
1   2     22
2   4     44
3   5     55
4   8    881
5   8    882
6   9     99

   ID   Name  Marks_x  Marks_y
0   2    Two       22     22.0
1   2    Two      221     22.0
2   3  Three       33      NaN
3   5   Five       55     55.0
4   6    Six       66      NaN
5   7  Seven       77      NaN
6   8  Eight      881    881.0
7   8  Eight      881    882.0

In [21]:
# import pandas as pd
import pandas as pd

# creating dataframes as df1 and df2
df1 = pd.DataFrame({'ID': [2, 2, 3, 5, 6, 7, 8],
					'Name': ['Two', 'Two', 'Three', 'Five', 'Six', 'Seven', 'Eight'],
                    'Marks': [22, 221, 33, 55, 66, 77, 881 ]})

df1

df2 = pd.DataFrame({'ID': [1, 2, 4, 5, 8, 8, 9],
					'Marks': [11, 22, 44, 55, 881, 882, 99, ]})

df2

# merging df1 and df2 based on the 'right' df ID
# i.e. the rows with ID's from 'right' dataframe get merged
df = pd.merge(df1, df2, on="ID", how='right')
df

   ID   Name  Marks
0   2    Two     22
1   2    Two    221
2   3  Three     33
3   5   Five     55
4   6    Six     66
5   7  Seven     77
6   8  Eight    881

   ID  Marks
0   1     11
1   2     22
2   4     44
3   5     55
4   8    881
5   8    882
6   9     99

   ID   Name  Marks_x  Marks_y
0   2    Two     22.0       22
1   2    Two    221.0       22
2   5   Five     55.0       55
3   8  Eight    881.0      881
4   8  Eight    881.0      882
5   1    NaN      NaN       11
6   4    NaN      NaN       44
7   9    NaN      NaN       99